mdhardenburgh/Blinky/Packages/.cache/Atmel.SAMS70_DFP.2.4.134.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMS70N19">
         <description>Headers and startup code for Atmel ATSAMS70N19</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/gcc/startup_sams70n19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/system_sams70n19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="sams70a/gcc/gcc/sams70n19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="sams70a/gcc/gcc/sams70n19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/system_sams70n19.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/ARM/startup_SAMS70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/iar/startup_sams70n19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/system_sams70n19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="sams70a/iar/config/linker/Microchip/atsams70n19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="sams70a/iar/config/linker/Microchip/atsams70n19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMS70Q21B">
         <description>Headers and startup code for Atmel ATSAMS70Q21B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="sams70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="sams70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="sams70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="sams70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="sams70b/gcc/gcc/startup_sams70q21b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="sams70b/gcc/system_sams70q21b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="sams70b/gcc/gcc/sams70q21b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="sams70b/gcc/gcc/sams70q21b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70b/armcc/Device/Source/system_sams70q21b.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70b/armcc/Device/Source/ARM/startup_SAMS70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70b/iar/iar/startup_sams70q21b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70b/iar/system_sams70q21b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="sams70b/iar/config/linker/Microchip/atsams70q21b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="sams70b/iar/config/linker/Microchip/atsams70q21b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMS70N20">
         <description>Headers and startup code for Atmel ATSAMS70N20</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/gcc/startup_sams70n20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/system_sams70n20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="sams70a/gcc/gcc/sams70n20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="sams70a/gcc/gcc/sams70n20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/system_sams70n20.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/ARM/startup_SAMS70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/iar/startup_sams70n20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/system_sams70n20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="sams70a/iar/config/linker/Microchip/atsams70n20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="sams70a/iar/config/linker/Microchip/atsams70n20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMS70J21">
         <description>Headers and startup code for Atmel ATSAMS70J21</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/gcc/startup_sams70j21.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/system_sams70j21.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="sams70a/gcc/gcc/sams70j21_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="sams70a/gcc/gcc/sams70j21_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/system_sams70j21.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/ARM/startup_SAMS70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/iar/startup_sams70j21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/system_sams70j21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="sams70a/iar/config/linker/Microchip/atsams70j21/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="sams70a/iar/config/linker/Microchip/atsams70j21/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMS70J20">
         <description>Headers and startup code for Atmel ATSAMS70J20</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="sams70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="sams70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/gcc/startup_sams70j20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="sams70a/gcc/system_sams70j20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="sams70a/gcc/gcc/sams70j20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="sams70a/gcc/gcc/sams70j20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/system_sams70j20.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70a/armcc/Device/Source/ARM/startup_SAMS70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/iar/startup_sams70j20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70a/iar/system_sams70j20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="sams70a/iar/config/linker/Microchip/atsams70j20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="sams70a/iar/config/linker/Microchip/atsams70j20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMS70N21B">
         <description>Headers and startup code for Atmel ATSAMS70N21B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="sams70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="sams70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="sams70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="sams70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="sams70b/gcc/gcc/startup_sams70n21b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="sams70b/gcc/system_sams70n21b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="sams70b/gcc/gcc/sams70n21b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="sams70b/gcc/gcc/sams70n21b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70b/armcc/Device/Source/system_sams70n21b.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70b/armcc/Device/Source/ARM/startup_SAMS70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70b/iar/iar/startup_sams70n21b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70b/iar/system_sams70n21b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="sams70b/iar/config/linker/Microchip/atsams70n21b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="sams70b/iar/config/linker/Microchip/atsams70n21b/flash.icf" attr="config"/>
         </files>
      </component>
