mdhardenburgh/Blinky/Packages/.cache/Atmel.SAMS70_DFP.2.4.134.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMS70N20B">
         <description>Headers and startup code for Atmel ATSAMS70N20B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="sams70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="sams70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="sams70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="sams70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="sams70b/gcc/gcc/startup_sams70n20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="sams70b/gcc/system_sams70n20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="sams70b/gcc/gcc/sams70n20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="sams70b/gcc/gcc/sams70n20b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70b/armcc/Device/Source/system_sams70n20b.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="sams70b/armcc/Device/Source/ARM/startup_SAMS70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70b/iar/iar/startup_sams70n20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="sams70b/iar/system_sams70n20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="sams70b/iar/config/linker/Microchip/atsams70n20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="sams70b/iar/config/linker/Microchip/atsams70n20b/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
